#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//int main()
//{
//	//类型决定空间大小和看待的视角
//	int a = 10;
//	float f = 10.0;
//	return 0;
//}

//int main()
//{
//	int a = 20;//4个字节 - 32bit
//	//00000000000000000000000000010100 - 原码
//	//00000000000000000000000000010100 - 反码
//	//00000000000000000000000000010100 - 补码
//	//0x00000014
//	int b = -10;
//	//10000000000000000000000000001010 - 原码
//	//11111111111111111111111111110101 - 反码
//	//11111111111111111111111111110110 - 补码
//	//0xfffffff6
//	return 0;
//}

//int main()
//{
//	int a = 20;
//	//小端模式，数据的地位保存在内存的低地址中，而数据的高位，保存在内存的高地址中。
//	return 0;
//}

////写一段代码来确定是小端存储还是大端存储
//int main()
//{
//	int a = 1;
//	char* p = (char*) & a;
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

////int check_sys()
////{
////	int a = 1;
////	char* p = (char*)&a;
////	return *p;
////}
//
//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//}
//
////写一段代码来确定是小端存储还是大端存储
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//	return 0;
//}

//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}

int main()
{
	char a = -128;
	char b = 128;
	//10000000000000000000000010000000
	//11111111111111111111111101111111
	//11111111111111111111111110000000 - 补码
	//10000000
	//11111111111111111111111110000000 - 补码(整型提升)
	printf("%u\n%u\n", a,b);
	//%d - 打印十进制的有符号数字
	//%u - 打印十进制的无符号数字
	return 0;
}