#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//int main()
//{
//	//类型决定空间大小和看待的视角
//	int a = 10;
//	float f = 10.0;
//	return 0;
//}

//int main()
//{
//	int a = 20;//4个字节 - 32bit
//	//00000000000000000000000000010100 - 原码
//	//00000000000000000000000000010100 - 反码
//	//00000000000000000000000000010100 - 补码
//	//0x00000014
//	int b = -10;
//	//10000000000000000000000000001010 - 原码
//	//11111111111111111111111111110101 - 反码
//	//11111111111111111111111111110110 - 补码
//	//0xfffffff6
//	return 0;
//}

//int main()
//{
//	int a = 20;
//	//小端模式，数据的地位保存在内存的低地址中，而数据的高位，保存在内存的高地址中。
//	return 0;
//}

